{
  "backend/main.mo": "Defines the backend canister with user, room, game, turn, and stats types plus storage maps and Google OAuth config defaults.",
  "feature_evidence.json": "Feature evidence report linking documentation requirements to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing UI components, game logic modules, and PWA assets.",
  "frontend/deploy/Caddyfile": "Caddy reverse proxy config showing how to route a custom domain to the frontend canister with HTTPS, SPA routing, caching, and security headers.",
  "frontend/deploy/nginx.conf": "Nginx reverse proxy config for serving the frontend canister with HTTPS, SPA routing, caching rules, and security headers.",
  "frontend/docs/configuration.md": "Explains all frontend and backend configuration values, including Google OAuth keys, their defaults, and where they are set.",
  "frontend/docs/deployment.md": "Deployment guide covering prerequisites, local development, production deployment, health checks, and optional reverse proxy setup.",
  "frontend/docs/game-snapshot-contract.md": "Documentation defining the canonical game snapshot format used for backend responses and realtime sync.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes with global styling applies.",
  "frontend/index.html": "HTML entry point setting metadata, icons, manifest, and mounts the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, colors, start URL, and icons.",
  "frontend/public/service-worker.js": "Service worker handling caching, offline support, SPA routing, and proxy‑friendly fetch logic.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all application routes and wraps the app in the router provider.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty placeholder component file.",
  "frontend/src/components/game/GameOverScreen.tsx": "Displays a game‑over card showing winner info and action buttons for stats, rematch, or new game.",
  "frontend/src/components/game/Keypad.tsx": "Renders a numeric keypad with quick‑score chips and optional voice input for score entry.",
  "frontend/src/components/game/PlayerCard.tsx": "Shows a player’s name, remaining score, and active status with styled UI elements.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting the user to resume or discard a saved in‑progress game.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "UI for entering up to three darts with multipliers, numbers, bull options, and submission logic.",
  "frontend/src/components/game/TurnHistory.tsx": "Shows the last five turns in a table with score, remaining points, and status icons, formatting dart details for each turn.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Modal dialog that displays recognized voice input and lets the user confirm or edit the proposed score.",
  "frontend/src/components/rooms/ClaimSeatPanel.tsx": "Panel allowing authenticated users to claim unassigned player seats, handling success and error states.",
  "frontend/src/components/rooms/DisplayScoreboard.tsx": "Displays player remaining scores and highlights the active player, or shows a winner summary when the game is over.",
  "frontend/src/components/rooms/GameSettingsPanel.tsx": "Form for creating a game with mode, double-out option, and 1–4 players including assignment to guest or self.",
  "frontend/src/components/rooms/HostLiveScoringPanel.tsx": "Host interface for entering scores, undoing turns, and viewing current player states during live scoring.",
  "frontend/src/components/rooms/RecentTurnsReadOnly.tsx": "Read‑only table of the last ten turns showing player, score, remaining points, and win/bust status.",
  "frontend/src/components/rooms/RoomCodeDisplay.tsx": "Displays a room code with a copy-to-clipboard button and visual feedback.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useGameDetails.ts": "Fetches metadata for a specific game using the backend actor.",
  "frontend/src/hooks/useGameHistory.ts": "Provides hooks to fetch a user's game history and paginated game turns from the backend.",
  "frontend/src/hooks/useGameRealtime.ts": "Subscribes to realtime game events via WebSocket transport and exposes connection state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, and logout through context.",
  "frontend/src/hooks/useMyProfile.ts": "Fetches the current user's profile and exposes loading state dependent on actor availability.",
  "frontend/src/hooks/usePlayerGameStats.ts": "Retrieves player game statistics by game or user using the backend actor.",
  "frontend/src/hooks/useSession.ts": "Wraps Internet Identity to provide app-level authentication helpers like sign-in and sign-out.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech recognition support with start/stop controls and transcript handling.",
  "frontend/src/hooks/useUserStats.ts": "Fetches statistics for the current user or a specific user via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/layouts/AppLayout.tsx": "Layout component with header, auth buttons, service worker registration, routed content, and footer.",
  "frontend/src/lib/adminTokenStorage.ts": "LocalStorage helpers to get, set, and clear admin tokens per room code.",
  "frontend/src/lib/checkoutSuggestions.ts": "Generates up to three popular dart checkout suggestions for valid scores when Double Out is enabled.",
  "frontend/src/lib/gameCore.ts": "Core game logic providing state types and functions for starting a game and applying three‑dart turns with double‑out rules.",
  "frontend/src/lib/gamePersistence.ts": "LocalStorage utilities for saving, loading, migrating, and clearing saved game state.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings and handles saving, loading, validating, and sanitizing settings in localStorage.",
  "frontend/src/lib/gameStats.ts": "Computes per‑player statistics such as averages, 180s, busts, and checkout percentages from game history.",
  "frontend/src/lib/playerDisplayName.ts": "Helpers to pick a player's display name and detect unclaimed player seats.",
  "frontend/src/lib/realtimeEventEnvelope.ts": "Defines realtime event schemas, game snapshot structure, and parsing/validation utilities.",
  "frontend/src/lib/realtimeTransport.ts": "Implements a WebSocket-based realtime transport with automatic reconnection and a fallback mode when WebSockets are unsupported.",
  "frontend/src/lib/roomGameApi.ts": "Provides functions for creating games, adding players, and submitting scores, including backend error parsing.",
  "frontend/src/lib/roomsApi.ts": "Contains utilities for generating room codes and creating or fetching rooms via backend actors.",
  "frontend/src/lib/voiceScoreParser.ts": "Parses spoken English phrases into numeric dart scores, handling direct numbers, tens, teens, and compound expressions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/GameDetailsPage.tsx": "Displays detailed game info and paginated turns, handling invalid IDs and loading states.",
  "frontend/src/pages/GameHistoryPage.tsx": "Shows authenticated users their game history with filters and pagination, prompting sign‑in when needed.",
  "frontend/src/pages/GamePage.tsx": "Main gameplay page managing game state, input modes, voice scoring, and realtime updates.",
  "frontend/src/pages/LoginPage.tsx": "Login screen handling Internet Identity sign‑in and redirecting authenticated users.",
  "frontend/src/pages/MyAccountPage.tsx": "Legacy account route that redirects users to the profile page after a short delay.",
  "frontend/src/pages/ProfilePage.tsx": "Profile screen showing user info, stats, and authentication state with sign‑in or setup prompts.",
  "frontend/src/pages/RegisterPage.tsx": "User registration page allowing authenticated users to create a profile with username and email.",
  "frontend/src/pages/RoomDisplayTvPage.tsx": "Read‑only TV display for a room’s live game, showing realtime snapshots and connection status.",
  "frontend/src/pages/RoomHostScorerPage.tsx": "Host page for creating and managing a room game, handling admin tokens, authentication, and live scoring updates.",
  "frontend/src/pages/StartGamePage.tsx": "UI for starting a local game or creating/joining a multi-device room, including player setup and room token handling.",
  "frontend/src/pages/StatsPage.tsx": "Displays statistics for the most recently saved game and allows navigation back to the game or home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL or session-based parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and enabled plugins.",
  "project_state.json": "Holds the current project state, including plans to add full user authentication to the Dart Scoring app and detailed architectural notes for the frontend UI, routing, and game-state persistence. Also lists existing implemented features and related metadata."
}