{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry point setting metadata, manifest, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest declaring app name, icons, colors, and display mode.",
  "frontend/src/App.tsx": "Configures TanStack Router with root, start, and game routes inside AppLayout.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Modal prompting the user to confirm a double finish with Yes/No actions.",
  "frontend/src/components/game/GameOverScreen.tsx": "Card-based Game Over screen showing winner, turn count, and rematch/new game actions.",
  "frontend/src/components/game/Keypad.tsx": "Numeric keypad with quick-score buttons, input display, clear, and submit actions.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name, remaining score, and active status styling.",
  "frontend/src/components/game/TurnHistory.tsx": "Renders the last five turns with player, score, remaining, and status indicators.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and refreshes a backend actor based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, wrapping AuthClient setup and exposing identity, login, logout, and status state.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for theming, including light and dark mode palettes.",
  "frontend/src/layouts/AppLayout.tsx": "Layout component with header, footer, and main content outlet for the Dart Scoring app.",
  "frontend/src/lib/gameCore.ts": "Pure game logic module handling game initialization, turn application with bust and double-out rules, state transitions, and history tracking.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings schema and utilities for saving, loading, and sanitizing settings using localStorage.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the root App component.",
  "frontend/src/pages/GamePage.tsx": "Game screen managing gameplay flow, turn input, validation, undo, double-out confirmation, and game-over handling.",
  "frontend/src/pages/StartGamePage.tsx": "Page for configuring and saving game settings, including mode, double-out option, and player names before starting a game.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, OKLCH-based color tokens, extended radii, shadows, and custom animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a Next.js PWA for dart scoring, including architecture notes, planned UI, and implemented features. Outlines gameplay rules, component structure, and navigation requirements."
}