{
  "backend/main.mo": "Defines core data types, OAuth config, and in-memory maps for rooms, games, players, users, stats, and events in the backend actor.",
  "feature_evidence.json": "Empty feature evidence report scaffold.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend source files and assets.",
  "frontend/deploy/Caddyfile": "Caddy reverse‑proxy config for serving the frontend canister with HTTPS, SPA routing, caching, and security headers.",
  "frontend/deploy/nginx.conf": "Nginx reverse‑proxy config for serving the frontend canister with SSL, caching rules, SPA routing, and security headers.",
  "frontend/docs/configuration.md": "Explains all frontend and backend configuration values, including canister IDs, IC host resolution, and Google OAuth settings.",
  "frontend/docs/deployment.md": "Deployment guide covering local development, production setup, health checks, configuration, and optional reverse proxies.",
  "frontend/docs/game-snapshot-contract.md": "Documentation defining the structure and usage of the canonical Game Snapshot for realtime sync and rendering.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables for light/dark themes and shared UI styling.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and generated icons.",
  "frontend/public/service-worker.js": "Service worker implementing caching, offline support, SPA routing fallback, and cache management.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all application routes and wraps the app in the router provider.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty component file placeholder for a double-finish confirmation modal.",
  "frontend/src/components/game/GameOverScreen.tsx": "UI component showing game results with winner info and actions for stats, rematch, or new game.",
  "frontend/src/components/game/Keypad.tsx": "Numeric keypad component with quick score chips, voice input option, and submit/clear actions.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name, remaining score, and active state highlighting.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting the user to resume or discard an in-progress saved game.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "Component for entering up to three darts with multipliers, number grid, bull options, and submission logic.",
  "frontend/src/components/game/TurnHistory.tsx": "Renders the last five turns with player, score, remaining points, and status icons, including bust and win indicators.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Displays a dialog to confirm or edit voice-recognized score input, showing transcript, parsed score, and action buttons.",
  "frontend/src/components/rooms/ClaimSeatPanel.tsx": "Allows authenticated users to claim unclaimed player seats, handling API calls, success/error states, and UI feedback.",
  "frontend/src/components/rooms/DisplayScoreboard.tsx": "Shows player scores and highlights the active player or displays a winner summary when the game is completed.",
  "frontend/src/components/rooms/GameSettingsPanel.tsx": "Provides UI to configure game mode, double-out option, and player assignments before creating a new game.",
  "frontend/src/components/rooms/HostLiveScoringPanel.tsx": "Enables hosts to enter scores, undo turns, and view player states while updating the game snapshot via API.",
  "frontend/src/components/rooms/RecentTurnsReadOnly.tsx": "Displays a read-only table of the most recent turns with player names, scores, remaining points, and win/bust status.",
  "frontend/src/components/rooms/RoomCodeDisplay.tsx": "UI component showing a room code with a copy-to-clipboard button and temporary success alert.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useGameDetails.ts": "Fetches game metadata for a given game ID using the backend actor.",
  "frontend/src/hooks/useGameHistory.ts": "Provides hooks to fetch a user's game history and paginated turns for a game via the backend actor.",
  "frontend/src/hooks/useGameRealtime.ts": "Manages a realtime WebSocket connection for game events and delivers snapshot updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity auth, identity loading, login, and state management.",
  "frontend/src/hooks/useMyProfile.ts": "Fetches the current user's profile and exposes loading state tied to actor readiness.",
  "frontend/src/hooks/useOAuthTokenSession.tsx": "In‑memory provider for storing and clearing a Google OAuth access token.",
  "frontend/src/hooks/usePlayerGameStats.ts": "Fetches player game statistics either by game ID or by user ID using the actor.",
  "frontend/src/hooks/useSession.ts": "High-level session abstraction combining Internet Identity auth and OAuth token management with sign-in/out helpers.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements browser speech recognition with start/stop control and transcript/error state.",
  "frontend/src/hooks/useUserStats.ts": "Fetches statistics for the current user or a specified user via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables and base element styling.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main app layout with header, footer, auth-aware buttons, and registers a service worker.",
  "frontend/src/lib/adminTokenStorage.ts": "Manages admin tokens per room code using localStorage with get, set, and clear helpers.",
  "frontend/src/lib/checkoutSuggestions.ts": "Generates up to three dart checkout suggestions for a given score when Double Out is enabled.",
  "frontend/src/lib/gameCore.ts": "Implements core game state, dart scoring, turn application with double-out logic, and win/bust detection.",
  "frontend/src/lib/gamePersistence.ts": "Handles saving, loading, migrating, and clearing game state in localStorage.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings, provides localStorage persistence, validation, and player name sanitization.",
  "frontend/src/lib/gameStats.ts": "Computes player statistics such as averages, 180s, busts, and checkout percentages from game history.",
  "frontend/src/lib/playerDisplayName.ts": "Provides helpers for selecting player display names and detecting unclaimed player seats.",
  "frontend/src/lib/realtimeEventEnvelope.ts": "Defines realtime event envelope types, game snapshot schema, and helpers for parsing and identifying events.",
  "frontend/src/lib/realtimeTransport.ts": "Implements a WebSocket-based realtime transport with fallback, reconnection, and event parsing.",
  "frontend/src/lib/roomGameApi.ts": "Provides functions to create games, add players, and submit scores in rooms, handling backend errors and returning snapshots.",
  "frontend/src/lib/roomsApi.ts": "Handles room creation and lookup via backend calls, generating room codes and returning admin tokens.",
  "frontend/src/lib/voiceScoreParser.ts": "Parses spoken English phrases into numeric dart scores using word-to-number rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers.",
  "frontend/src/pages/GameDetailsPage.tsx": "Displays game details and paginated turns, handling loading, errors, and navigation.",
  "frontend/src/pages/GameHistoryPage.tsx": "Displays a user’s game history with filters for mode and date, handling authentication and pagination. Fetches history data and navigates to individual game pages.",
  "frontend/src/pages/GamePage.tsx": "Runs the main game UI including scoring, voice input, turn history, and realtime updates. Manages game state, persistence, and navigation from URL parameters.",
  "frontend/src/pages/GoogleOAuthRedirectPage.tsx": "Handles Google OAuth callback, processes token or errors, updates session state, and redirects users. Cleans sensitive data from the URL after processing.",
  "frontend/src/pages/LoginPage.tsx": "Provides login options via Internet Identity or Google OAuth, showing loading and error states. Redirects authenticated users to their profile.",
  "frontend/src/pages/MyAccountPage.tsx": "Legacy account page that automatically redirects users to the new profile page after initialization. Shows transitional UI with manual redirect option.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile and stats when authenticated, or prompts users to sign in or complete registration. Includes sign‑out support and loading states.",
  "frontend/src/pages/RegisterPage.tsx": "Page that handles user profile creation, performing validation, registration mutation, and conditional UI for auth, loading, and existing profiles.",
  "frontend/src/pages/RoomDisplayTvPage.tsx": "Read‑only TV display for a room that connects to realtime updates and shows scoreboard and recent turns with connection status indicators.",
  "frontend/src/pages/RoomHostScorerPage.tsx": "Host/scorer control page for creating and managing a room’s game, handling admin tokens, authorization, game creation, and live scoring updates.",
  "frontend/src/pages/StartGamePage.tsx": "Starting page to configure game settings or manage multi‑device room creation/joining, including admin token storage and navigation.",
  "frontend/src/pages/StatsPage.tsx": "Displays computed statistics for a saved game or shows a message if no game data exists, with navigation back to game or home.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes the project’s current state and architecture, focusing on user authentication additions and planned frontend/game features."
}