{
  "backend/main.mo": "Main Motoko actor defining room, game, player, turn, and shot-event types with in‑memory maps and CRUD methods plus a health check.",
  "backend/migration.mo": "Migration module returning old actor state unchanged, serving as a no-op data migration layer.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of core frontend files including routing, pages, components, styling, and PWA setup.",
  "frontend/index.css": "Global Tailwind setup defining light/dark OKLCH color variables and base styling rules.",
  "frontend/index.html": "HTML entry point loading the React app with PWA manifest and icons.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, start URL, and icons.",
  "frontend/public/service-worker.js": "Service worker implementing offline caching with cache-first static assets and network-first navigation handling.",
  "frontend/src/App.tsx": "React router setup defining layout and routes for start, game, and stats pages.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty placeholder file for a double-finish confirmation modal component.",
  "frontend/src/components/game/GameOverScreen.tsx": "UI component displaying winner info, turn count, and actions for stats, rematch, or new game.",
  "frontend/src/components/game/Keypad.tsx": "Interactive numeric keypad with quick score chips and optional voice input button.",
  "frontend/src/components/game/PlayerCard.tsx": "Card component showing player name, remaining score, and active-player highlighting.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting the user to resume or discard a saved in‑progress game, with resume and discard actions.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "UI for entering up to three darts with multiplier, number, and bull options, and submitting or clearing entries.",
  "frontend/src/components/game/TurnHistory.tsx": "Renders a table showing the last five turns with score, remaining points, busts, and win indicators.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Modal confirming speech‑recognized score input, showing transcript and proposed score with edit or OK actions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and login state handling.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Hook wrapping browser SpeechRecognition to start/stop listening and provide transcript, errors, and support detection.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining theme colors and layout for light and dark modes.",
  "frontend/src/layouts/AppLayout.tsx": "Layout component that registers a service worker and renders the header, footer, and routed content.",
  "frontend/src/lib/checkoutSuggestions.ts": "Provides curated checkout suggestions for darts based on remaining score and Double Out rules.",
  "frontend/src/lib/gameCore.ts": "Defines core game types and logic including scoring, turn application, win conditions, and game initialization.",
  "frontend/src/lib/gamePersistence.ts": "Handles saving, loading, migrating, and clearing game state in localStorage.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings and utilities for saving, loading, validating, and sanitizing them via localStorage.",
  "frontend/src/lib/gameStats.ts": "Computes per‑player statistics such as averages, 180s, busts, and checkout percentage from game history.",
  "frontend/src/lib/voiceScoreParser.ts": "Parses spoken English phrases into numeric dart scores using word-to-number matching and patterns.",
  "frontend/src/main.tsx": "Application entry that sets up React root, query client, identity provider, and renders App.",
  "frontend/src/pages/GamePage.tsx": "Main game screen managing active game state, input modes, voice scoring, turn application/undo, saved-game resume, and navigation.",
  "frontend/src/pages/StartGamePage.tsx": "Start screen allowing users to configure game mode, double-out, and players, then save settings and navigate to the game.",
  "frontend/src/pages/StatsPage.tsx": "Displays statistics for the saved or active game and provides navigation back to the game or home.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme, colors, animations, and enabling typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current app architecture, implemented features, and planned functionality."
}