{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of major frontend source files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global element styling.",
  "frontend/index.html": "PWA-ready HTML entry point linking manifest, icons, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, theme colors, start URL, and icons.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for StartGamePage and GamePage.",
  "frontend/src/components/game/Keypad.tsx": "Touch-friendly keypad UI with number buttons plus clear and submit actions.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name, score, and active-state styling in a card layout.",
  "frontend/src/components/game/TurnHistory.tsx": "Scrollable table showing mock turn history with player, score, and remaining points.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication provider and hook wrapping Dfinity AuthClient to manage Internet Identity login state.",
  "frontend/src/index.css": "Tailwind global style sheet defining design tokens, dark mode variables, and touch-friendly UI rules.",
  "frontend/src/layouts/AppLayout.tsx": "Defines the main app layout with header, content outlet, and footer.",
  "frontend/src/lib/gameSettings.ts": "Provides types and utilities to save, load, and sanitize game settings in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/GamePage.tsx": "Renders the game screen using loaded settings, showing players, keypad, and turn history with navigation back.",
  "frontend/src/pages/StartGamePage.tsx": "Provides UI for configuring game mode, double-out, and player names, then saves settings and starts game.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, animations, and container settings.",
  "project_state.json": "Project metadata describing architecture, requirements, known issues, and existing implemented features."
}