{
  "backend/main.mo": "Defines backend actor with OAuth config, user accounts, room/game/player data models, and in‑memory maps for persistent storage.",
  "feature_evidence.json": "Report mapping implemented features to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including pages, components, utilities, and styles.",
  "frontend/deploy/Caddyfile": "Caddy reverse‑proxy config routing /api/* to backend canister and all other paths to frontend canister with caching and security headers.",
  "frontend/deploy/nginx.conf": "Nginx reverse‑proxy config routing /api/* to backend canister, serving frontend canister for other routes, and setting caching, SSL, and security headers.",
  "frontend/docs/configuration.md": "Documentation describing frontend and backend configuration, environment variables, canister connection, and same‑origin API behavior.",
  "frontend/docs/deployment.md": "Deployment guide covering prerequisites, local development steps, production deployment, and reverse‑proxy setup.",
  "frontend/docs/game-snapshot-contract.md": "Documentation defining the canonical game snapshot structure used for realtime syncing and frontend rendering.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, and display settings.",
  "frontend/public/service-worker.js": "Service worker implementing caching, offline support, and cache management for the PWA.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes and renders the router provider.",
  "frontend/src/components/dev/BackendDebugPanel.tsx": "UI panel for testing backend health and displaying the detected backend URL.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty placeholder component file.",
  "frontend/src/components/game/GameOverScreen.tsx": "Displays a game-over summary with winner info and action buttons.",
  "frontend/src/components/game/Keypad.tsx": "Numeric keypad component with quick scores, voice button, and submit/clear actions.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name, remaining score, and active status highlighting.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting the user to resume or discard a previously saved game.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "UI component for selecting up to three darts with multipliers, numbers, and bull options, then submitting them.",
  "frontend/src/components/game/TurnHistory.tsx": "Shows the last five turns with player names, scores, remaining points, and status icons.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Modal prompting users to confirm or edit a voice‑recognized score before submitting.",
  "frontend/src/components/rooms/ClaimSeatPanel.tsx": "Panel allowing authenticated users to claim unclaimed player seats with success and error handling.",
  "frontend/src/components/rooms/DisplayScoreboard.tsx": "Displays current player scores or a game‑over winner view with turns taken.",
  "frontend/src/components/rooms/GameSettingsPanel.tsx": "Form for configuring new games, including mode, double‑out option, and player assignments.",
  "frontend/src/components/rooms/HostLiveScoringPanel.tsx": "UI for hosts to input scores and undo turns, updating the game snapshot via API calls.",
  "frontend/src/components/rooms/RecentTurnsReadOnly.tsx": "Displays the last 10 turns in a read‑only table showing player, score, remaining, and status.",
  "frontend/src/components/rooms/RoomCodeDisplay.tsx": "Shows the room code with a copy-to-clipboard button and confirmation alert.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useGameDetails.ts": "Fetches metadata for a specific game using the backend actor.",
  "frontend/src/hooks/useGameHistory.ts": "Provides hooks for fetching a user’s game history and paginated game turns.",
  "frontend/src/hooks/useGameRealtime.ts": "Manages realtime WebSocket subscription for game snapshots with auto-connect and reconnect logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useMyProfile.ts": "Fetches the current user’s profile and exposes loading state dependent on actor readiness.",
  "frontend/src/hooks/useOAuthTokenSession.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/usePlayerGameStats.ts": "Hooks to fetch player game statistics by game or by user.",
  "frontend/src/hooks/useSession.ts": "Wraps Internet Identity to expose high-level auth state, sign-in/out, and session utilities.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping browser SpeechRecognition, managing listening state, transcript, and errors.",
  "frontend/src/hooks/useUserStats.ts": "React-query hooks that fetch current or specific user statistics through the actor API.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens and global styles.",
  "frontend/src/layouts/AppLayout.tsx": "Main app layout with header, session-aware profile menu, and service worker registration.",
  "frontend/src/lib/adminTokenStorage.ts": "Utilities to store, fetch, and remove admin tokens in localStorage by normalized room code.",
  "frontend/src/lib/authHeaders.ts": "Builds request auth headers, adding X-ADMIN-TOKEN for mutations using stored admin tokens.",
  "frontend/src/lib/checkoutSuggestions.ts": "Returns curated checkout routes for darts based on remaining score and Double Out rules.",
  "frontend/src/lib/config.ts": "Defines backend base URL and helpers for resolving and joining API endpoints.",
  "frontend/src/lib/gameCore.ts": "Game logic module handling scoring, turn application, busts, and win conditions for darts.",
  "frontend/src/lib/gamePersistence.ts": "Provides localStorage save/load utilities for game state with turn migration and basic validation.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings and handles saving, loading, validating, and sanitizing player settings via localStorage.",
  "frontend/src/lib/gameStats.ts": "Computes per‑player statistics such as averages, 180s, busts, and checkout percentage from game turns.",
  "frontend/src/lib/httpClient.ts": "Wraps fetch calls to the backend with CORS‑safe settings and consistent JSON response handling.",
  "frontend/src/lib/playerDisplayName.ts": "Supplies helpers to choose a player's display name and detect unclaimed seats.",
  "frontend/src/lib/realtimeEventEnvelope.ts": "Defines realtime event envelope types, snapshot schema, and utilities to parse and validate incoming events.",
  "frontend/src/lib/realtimeTransport.ts": "Implements a WebSocket‑based realtime transport with fallback, reconnection, and event dispatching.",
  "frontend/src/lib/roomGameApi.ts": "Provides API helpers for creating room games, claiming seats, and fetching snapshots via backend actors.",
  "frontend/src/lib/roomsApi.ts": "Provides functions to create rooms and fetch rooms by code using a backend actor, including random code generation and error handling.",
  "frontend/src/lib/voiceScoreParser.ts": "Converts spoken English number phrases into numeric dart scores, supporting hundreds, tens, and compound forms.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider and mounts it to the DOM.",
  "frontend/src/pages/GameDetailsPage.tsx": "Displays detailed game info and paginated turn history fetched from the backend, handling invalid IDs and loading states.",
  "frontend/src/pages/GameHistoryPage.tsx": "Shows authenticated users a paginated, filterable list of their past games with date and mode filters.",
  "frontend/src/pages/GamePage.tsx": "Manages active gameplay including input, voice recognition, turn logic, realtime updates, and game state persistence.",
  "frontend/src/pages/GoogleOAuthRedirectPage.tsx": "Placeholder page for handling Google OAuth redirect.",
  "frontend/src/pages/LoginPage.tsx": "Provides sign‑in flow using Internet Identity with redirect logic and error handling.",
  "frontend/src/pages/MyAccountPage.tsx": "Legacy account route that automatically redirects users to the new profile page.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with authentication states, showing sign-in, registration prompts, or profile details with stats.",
  "frontend/src/pages/RegisterPage.tsx": "Handles profile creation with validation, authentication checks, and mutation to register a new user.",
  "frontend/src/pages/RoomDisplayTvPage.tsx": "Shows a read-only TV/scoreboard view for a room, connecting to realtime game updates and handling connection states.",
  "frontend/src/pages/RoomHostScorerPage.tsx": "Allows hosts to create and manage games for a room, handling admin tokens, settings, and live scoring updates.",
  "frontend/src/pages/StartGamePage.tsx": "Provides UI to start a local game or create/join multiplayer rooms, managing player setup, modes, and backend room creation.",
  "frontend/src/pages/StatsPage.tsx": "Renders a statistics page showing saved game data, navigating back based on game state and displaying computed per‑player stats in a table.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend build.",
  "frontend/vite.config.ts": "Vite config enabling React plugins, environment variable injection, path aliases, dev server proxy, and build output setup.",
  "project_state.json": "Tracks project state, requirements, architecture notes, and known issues for the Dart Scoring app."
}