{
  "backend/main.mo": "Defines core backend actor with OAuth config, user management types, and persistent maps for rooms, games, players, turns, and stats.",
  "feature_evidence.json": "Empty feature evidence report scaffold.",
  "frontend-file-summaries.txt": "Lists summaries of all major frontend components, pages, libs, and UI modules.",
  "frontend/deploy/Caddyfile": "Caddy reverse proxy config routing /api to backend canister and all other paths to frontend with caching and security headers.",
  "frontend/deploy/nginx.conf": "Nginx reverse proxy config forwarding /api to backend canister and SPA routes to frontend with SSL and caching settings.",
  "frontend/docs/configuration.md": "Explains frontend and backend configuration, environment variables, same-origin API behavior, and local dev setup.",
  "frontend/docs/deployment.md": "Deployment instructions for local and production IC environments plus reverse proxy setup and verification steps.",
  "frontend/docs/game-snapshot-contract.md": "Describes the structure and purpose of the canonical Game Snapshot used for realtime sync and UI rendering.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH design tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point defining metadata, PWA manifest, icons, and root mount element.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, colors, display mode, and icons.",
  "frontend/public/service-worker.js": "Implements a PWA service worker for caching assets, handling SPA navigation, and supporting reverse-proxy deployments.",
  "frontend/src/App.tsx": "Defines the application's TanStack Router route tree and wraps routing with an OAuth token session provider.",
  "frontend/src/components/dev/BackendDebugPanel.tsx": "Provides a UI panel to test backend health and Google OAuth start endpoints with status feedback.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty file with no implemented component.",
  "frontend/src/components/game/GameOverScreen.tsx": "Renders a game-over card showing the winner, turn count, and buttons for stats, rematch, or a new game.",
  "frontend/src/components/game/Keypad.tsx": "A numeric keypad with quick-score chips and optional voice input for entering score values.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name and remaining score, highlighting when the player is active.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting the user to resume or discard a previously saved in-progress game.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "UI for entering up to three darts with multiplier and bull options, displaying selected darts before submission.",
  "frontend/src/components/game/TurnHistory.tsx": "Renders a table showing the last five turns, formatting dart details and status icons for busts and wins.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Modal prompting users to confirm or edit voice-recognized score input with OK/Edit actions.",
  "frontend/src/components/rooms/ClaimSeatPanel.tsx": "Displays unclaimed player seats and lets authenticated users claim a seat, showing errors and success states.",
  "frontend/src/components/rooms/DisplayScoreboard.tsx": "Shows either a winner summary when the game ends or live per‑player remaining scores with active player highlighting.",
  "frontend/src/components/rooms/GameSettingsPanel.tsx": "Form for creating a new game, letting users pick mode, double-out, and configure up to four players.",
  "frontend/src/components/rooms/HostLiveScoringPanel.tsx": "Admin scoring UI enabling score submission, undoing turns, and viewing player remaining scores.",
  "frontend/src/components/rooms/RecentTurnsReadOnly.tsx": "Read‑only table showing the last ten turns with player names, scores, remaining points, and win/bust status.",
  "frontend/src/components/rooms/RoomCodeDisplay.tsx": "Displays a room code and provides a button to copy it with visual feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useGameDetails.ts": "Fetches metadata for a specific game using the backend actor.",
  "frontend/src/hooks/useGameHistory.ts": "Fetches a user's game history and paginated game turns via the backend actor.",
  "frontend/src/hooks/useGameRealtime.ts": "Manages a realtime WebSocket connection for receiving game snapshot events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity loading, and state management.",
  "frontend/src/hooks/useMyProfile.ts": "Fetches the current user's profile to determine registration or profile display state.",
  "frontend/src/hooks/useOAuthTokenSession.tsx": "Stores Google OAuth tokens in memory only and exposes hooks to access or clear them.",
  "frontend/src/hooks/usePlayerGameStats.ts": "Fetches player game statistics either by game or by user using the backend actor.",
  "frontend/src/hooks/useSession.ts": "Combines Internet Identity and OAuth token handling into a unified session abstraction with sign-in/out logic.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Provides speech recognition support with listening control, transcript capture, and error handling.",
  "frontend/src/hooks/useUserStats.ts": "Retrieves user statistics for the current user or a specified user from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/layouts/AppLayout.tsx": "Layout component with header, footer, auth-aware buttons, and service worker registration, rendering routed content via Outlet.",
  "frontend/src/lib/adminTokenStorage.ts": "Provides localStorage helpers to get, set, and clear admin tokens per room code.",
  "frontend/src/lib/checkoutSuggestions.ts": "Generates up to three dart checkout suggestions based on remaining score and double-out rules.",
  "frontend/src/lib/config.ts": "Resolves backend base URL to same-origin /api and includes a safe URL join helper.",
  "frontend/src/lib/gameCore.ts": "Implements core game logic, including state structures and turn application with scoring, bust, and double-out rules.",
  "frontend/src/lib/gamePersistence.ts": "Handles saving, loading, migrating, and clearing game state in localStorage.",
  "frontend/src/lib/gameSettings.ts": "Manages game settings with defaults, validation, sanitization, and localStorage persistence.",
  "frontend/src/lib/gameStats.ts": "Computes per-player statistics from game history, including averages, 180s, busts, and checkout percentages.",
  "frontend/src/lib/playerDisplayName.ts": "Utilities to derive display names for players and detect unclaimed player seats.",
  "frontend/src/lib/realtimeEventEnvelope.ts": "Defines realtime event types, game snapshot schema, and utilities for parsing event envelopes.",
  "frontend/src/lib/realtimeTransport.ts": "Implements a WebSocket-based realtime transport with automatic fallback, reconnection, and event parsing.",
  "frontend/src/lib/roomGameApi.ts": "Provides async helpers for creating games, adding players, and submitting scores using backend actor calls.",
  "frontend/src/lib/roomsApi.ts": "Handles room creation and lookup, including code generation and backend integration.",
  "frontend/src/lib/voiceScoreParser.ts": "Parses spoken phrases into numeric dart scores, supporting various English number patterns.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers.",
  "frontend/src/pages/GameDetailsPage.tsx": "Displays detailed game info and paginated turns, including fetch logic and error handling.",
  "frontend/src/pages/GameHistoryPage.tsx": "Displays a user's game history with filters for mode and date, requiring authentication. Fetches paginated game records and allows navigation to individual game details.",
  "frontend/src/pages/GamePage.tsx": "Manages gameplay state, score entry, voice input, and real-time updates, supporting both new and resumed games. Renders player info, turn history, and game over handling.",
  "frontend/src/pages/GoogleOAuthRedirectPage.tsx": "Processes Google OAuth redirect parameters, handles errors, stores the token, and redirects the user accordingly. Shows status screens for processing, success, or failure.",
  "frontend/src/pages/LoginPage.tsx": "Shows login options using Internet Identity or Google OAuth and redirects authenticated users to their profile. Handles loading, errors, and dev-mode backend debugging.",
  "frontend/src/pages/MyAccountPage.tsx": "Legacy account page that automatically redirects users to the new profile page after a short delay. Shows a simple redirect notice and manual navigation button.",
  "frontend/src/pages/ProfilePage.tsx": "Displays profile and stats when authenticated, otherwise prompts for login or profile creation. Supports sign-out and shows loading states during session or profile fetch.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page handling profile creation, authentication checks, and redirect flow using mutations and form inputs.",
  "frontend/src/pages/RoomDisplayTvPage.tsx": "TV display page showing a read‑only scoreboard with realtime game updates and connection status indicators.",
  "frontend/src/pages/RoomHostScorerPage.tsx": "Host scoring page for creating or managing a room’s game, handling admin tokens, authentication, and live snapshot updates.",
  "frontend/src/pages/StartGamePage.tsx": "Start screen for creating a local game or setting up/joining a multi‑device room with player and mode configuration.",
  "frontend/src/pages/StatsPage.tsx": "Statistics page showing computed game stats or a no‑data message, with navigation back to game or home.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them to sessionStorage, retrieve them, and clear them from session or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Defines Vite setup with React plugin, environment variable injection, path aliases, dev server proxying, and build output config.",
  "project_state.json": "Tracks project architecture, required frontend/backend changes, known issues, and feature state for the Dart Scoring app."
}