{
  "backend/main.mo": "Primary Motoko actor implementing rooms, games, turns, shot events, ID generation, admin-token validation, and CRUD-style methods for room/game management.",
  "backend/migration.mo": "Migration module converting old Room records into new ones by adding an adminToken field and producing a transformed Actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for admin-token and host/scorer UI changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, components, utilities, and configuration.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH theme variables for light/dark modes and base styling.",
  "frontend/index.html": "Main HTML entry point configuring metadata, PWA manifest, icons, and mounting the React root.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app name, theme, start URL, display mode, and icon assets.",
  "frontend/public/service-worker.js": "Service worker implementing install, activate, and fetch handlers for offline caching of core assets.",
  "frontend/src/App.tsx": "Top-level React routing configuration using TanStack Router with routes for start, game, stats, host, and display screens.",
  "frontend/src/components/game/DoubleFinishConfirmModal.tsx": "Empty placeholder file intended for a double-finish confirmation modal component.",
  "frontend/src/components/game/GameOverScreen.tsx": "UI component showing winner details and offering actions for stats, rematch, or starting a new game.",
  "frontend/src/components/game/Keypad.tsx": "Numeric keypad with quick chips, voice input button, and controls for clearing and submitting scores.",
  "frontend/src/components/game/PlayerCard.tsx": "Displays a player's name and remaining score with styling for the active player.",
  "frontend/src/components/game/ResumeSavedGamePromptModal.tsx": "Modal prompting users to resume or discard a previously saved game.",
  "frontend/src/components/game/ThreeDartsEntry.tsx": "UI for entering up to three darts with multiplier, value, bull options, and submission controls.",
  "frontend/src/components/game/TurnHistory.tsx": "Renders the last five turns with dart breakdowns, busts, and win indicators in a table.",
  "frontend/src/components/game/VoiceScoreConfirmModal.tsx": "Modal to review voice-transcribed score input and either confirm or edit it.",
  "frontend/src/components/rooms/DisplayScoreboard.tsx": "Shows either a game-over winner card or a live scoreboard highlighting the active player.",
  "frontend/src/components/rooms/GameSettingsPanel.tsx": "Panel for configuring game mode, double-out rule, and player names before creating a game.",
  "frontend/src/components/rooms/HostLiveScoringPanel.tsx": "Interactive host scoring panel allowing score entry, undo actions, and displaying players and recent turns using snapshot state.",
  "frontend/src/components/rooms/RecentTurnsReadOnly.tsx": "Read‑only component showing the 10 most recent turns in a table with scores, remaining points, and win indicators.",
  "frontend/src/components/rooms/RoomCodeDisplay.tsx": "Displays the room code with a copy‑to‑clipboard button and visual confirmation alert.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing on identity changes.",
  "frontend/src/hooks/useGameRealtime.ts": "Hook managing realtime WebSocket connections for game snapshots, exposing connection state and delivering updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity login, stored identities, and authentication state via AuthClient.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping browser SpeechRecognition to provide transcript, errors, and listen/stop/reset controls.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables defining theme colors for light and dark modes.",
  "frontend/src/layouts/AppLayout.tsx": "Main app layout registering a service worker and rendering header, routed content, and footer.",
  "frontend/src/lib/adminTokenStorage.ts": "Provides localStorage helpers to get, set, and clear per-room admin tokens with error handling.",
  "frontend/src/lib/checkoutSuggestions.ts": "Generates up to three curated dart checkout routes for valid scores when Double Out is enabled.",
  "frontend/src/lib/gameCore.ts": "Implements core game state, turn application logic, dart scoring, and win/bust rules.",
  "frontend/src/lib/gamePersistence.ts": "Handles saving, loading, migrating, and clearing game state in localStorage.",
  "frontend/src/lib/gameSettings.ts": "Defines game settings and provides localStorage load/save plus validation and player name sanitization.",
  "frontend/src/lib/gameStats.ts": "Computes per‑player statistics such as averages, 180s, busts, and checkout percentages from game history.",
  "frontend/src/lib/realtimeEventEnvelope.ts": "Defines realtime event envelope types and provides parsing and validation utilities.",
  "frontend/src/lib/realtimeTransport.ts": "Implements a WebSocket-based realtime transport with fallback, reconnection, and event handling.",
  "frontend/src/lib/roomGameApi.ts": "Provides functions to create games and submit scores for rooms, including local snapshot updates and backend error parsing.",
  "frontend/src/lib/roomsApi.ts": "Handles room creation with generated codes and admin tokens, plus fetching and validating rooms via backend actor calls.",
  "frontend/src/lib/voiceScoreParser.ts": "Parses spoken English phrases into numeric dart scores, supporting direct numbers and common word patterns.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/GamePage.tsx": "Main gameplay UI handling input, voice scoring, realtime updates, persistence, and turn management.",
  "frontend/src/pages/RoomDisplayTvPage.tsx": "Read‑only TV display showing scoreboard and recent turns with realtime room-based updates.",
  "frontend/src/pages/RoomHostScorerPage.tsx": "Host/scorer interface for creating games, managing admin tokens, and viewing live game snapshots.",
  "frontend/src/pages/StartGamePage.tsx": "UI for configuring a new game or multi‑device room, managing players, settings, and navigation to game or room views.",
  "frontend/src/pages/StatsPage.tsx": "Loads saved game data, computes statistics, and displays player stats with navigation back to game or home.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, container settings, and animations.",
  "project_state.json": "Project meta‑state describing app requirements, architecture, features, and current versioning information."
}