{
  "kind": "build_request",
  "title": "Add Double Out finish confirmation and Game Over flow (winner, turns, rematch/new game)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Update the game-core rules to support finishing a leg and producing a Game Over state.\n\nRules to implement:\n- If Double Out is OFF and a turn results in remaining == 0, immediately end the game and record the winner.\n- If Double Out is ON and a turn results in remaining == 0, do not immediately end the game; instead mark the game as awaiting double-finish confirmation so the UI can prompt the user.\n- If Double Out is ON and remaining would become 1, continue treating it as a bust.\n\nThe game-core state must expose enough information for the UI to:\n- Know when the game is awaiting double confirmation\n- Know when the game is over\n- Identify the winner (player index/name)\n- Display the number of turns taken to win",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Jeśli DoubleOut OFF i remaining == 0 → Game Over (zwycięzca)",
          "Jeśli DoubleOut ON i remaining == 0: pokaż modal/prompt: “Was it a double finish?”"
        ]
      },
      "acceptanceCriteria": [
        "With Double Out OFF, entering an exact checkout to 0 transitions the game into a game-over state and records the finishing player as winner.",
        "With Double Out ON, entering an exact checkout to 0 transitions the game into an awaiting-confirmation state (not game-over yet).",
        "The game-core state provides winner info and turn count when game-over is reached.",
        "Existing bust behavior (remaining < 0 or Double Out ON and newRemaining == 1) continues to work as before."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement the Double Out confirmation prompt in the /game UI.\n\nWhen Double Out is ON and the game enters the awaiting double-finish confirmation state, immediately show a modal/prompt with the exact text:\n\"Was it a double finish?\"\n\nThe prompt must provide two actions:\n- YES: confirm the double finish and complete the win (transition to Game Over)\n- NO: treat the last scoring attempt like a bust by reverting the effect of that turn (restore the player’s remaining score to what it was before the turn) and continue the game normally\n\nWhile awaiting confirmation, prevent further score entry from being applied until the user chooses YES or NO.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "pokaż modal/prompt: “Was it a double finish?”",
          "YES → Game Over",
          "NO → traktuj jak bust (cofnij efekt tury)"
        ]
      },
      "acceptanceCriteria": [
        "When awaiting confirmation, the UI shows a prompt/modal containing exactly: \"Was it a double finish?\".",
        "Choosing YES ends the game and proceeds to the Game Over screen/section.",
        "Choosing NO reverts the last turn’s scoring effect (remaining restored to the pre-turn value) and the game continues (the user can keep entering scores).",
        "No additional score submissions can be applied until the confirmation prompt is resolved."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add a Game Over screen in the frontend that appears when the game reaches a completed win state.\n\nThe Game Over screen must display:\n- The winner (player name)\n- The number of turns taken\n\nThe Game Over screen must include two buttons:\n- \"Rematch\" (start a new game using the same settings as the finished game)\n- \"New Game\" (navigate back to the Start Game page at /)\n\nUser-facing text on this screen must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Ekran Game Over: zwycięzca + liczba tur",
          "przyciski: Rematch (te same ustawienia), New Game (wróć na start)"
        ]
      },
      "acceptanceCriteria": [
        "When a game is won, the app shows a Game Over UI that clearly displays winner name and turn count.",
        "Clicking \"Rematch\" starts a fresh game with the same settings (mode, Double Out flag, player names) and resets scores/turn history.",
        "Clicking \"New Game\" navigates to / (Start Game) without crashing.",
        "All visible text added for Game Over/confirmation is English."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui (compose existing UI primitives instead).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this feature unless strictly necessary.",
    "Do not route any UI assets through the backend."
  ],
  "nonGoals": [
    "Adding online/multiplayer features or real-time synchronization.",
    "Persisting game-in-progress state to the backend.",
    "Changing the Start Game settings UX beyond what is necessary for Rematch/New Game navigation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}