{
  "kind": "build_request",
  "title": "Add scorer/admin token protection for multi-device rooms and state-mutating endpoints",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-91",
      "text": "Extend the backend Room/Game data model to include an admin/scorer token (e.g., `adminToken : Text`) generated by the backend when creating a room (and, if needed, when creating a game). The token must be treated as a secret and must not be derivable from the room code.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "“scorer token” generowany przy tworzeniu room/game (np. room.admin_token)"
        ]
      },
      "acceptanceCriteria": [
        "Creating a room produces an admin/scorer token value generated server-side (not provided by the client).",
        "The token is stored on the room (and/or game) in backend state and can be used for later authorization checks.",
        "The token is not included in read-only room/game snapshot responses intended for TV/display clients unless explicitly required by the host flow."
      ]
    },
    {
      "id": "REQ-92",
      "text": "Update backend state-mutating methods so they require an admin token to be provided and validated. Any method that modifies backend state must enforce the equivalent of requiring HTTP header `X-ADMIN-TOKEN` by accepting a token parameter (since canister calls do not provide HTTP headers) and rejecting the call with a structured, non-trapping error when the token is missing/invalid.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "endpointy modyfikujące stan wymagają headera X-ADMIN-TOKEN"
        ]
      },
      "acceptanceCriteria": [
        "State-mutating operations (at minimum: create game, create turn/score entry, undo, edit last turn, finish game, and any other mutation endpoints already exposed) require an admin token parameter.",
        "If the token is missing or does not match the stored admin token for the room/game, the backend returns a non-trapping error with a machine-readable code and an English message (e.g., \"Invalid admin token\").",
        "Read-only/query operations remain callable without any token."
      ]
    },
    {
      "id": "REQ-93",
      "text": "Ensure TV/display read-only flows do not require any token and continue to work using only the room code/game identifier (including realtime subscription).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "widoki TV nie wymagają tokena, tylko room code"
        ]
      },
      "acceptanceCriteria": [
        "The Display / TV page can load/subscribe and render snapshots without providing any admin token.",
        "No token input is required anywhere in the Display / TV UI.",
        "Backend read-only APIs used by the Display / TV flow do not require a token parameter."
      ]
    },
    {
      "id": "REQ-94",
      "text": "Update the frontend multi-device Create Room flow to capture and persist the returned scorer/admin token for the created room (e.g., in localStorage keyed by room code) and use it automatically for Host / Scorer actions on that device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "To jest proste i bez kont użytkowników."
        ]
      },
      "acceptanceCriteria": [
        "After a successful Create Room action, the frontend stores the returned admin token locally in a persistent way (localStorage is acceptable) associated with the room code.",
        "Navigating to Host / Scorer from the room-created screen uses the stored token automatically when calling backend mutations.",
        "If the token is missing locally, Host / Scorer mutations fail gracefully with an English error message and do not crash the app."
      ]
    },
    {
      "id": "REQ-95",
      "text": "Add a minimal frontend UI for the Host / Scorer role to handle scorer/admin tokens across devices: allow the user to enter a scorer token when joining a room (or when opening Host / Scorer without a saved token), persist it locally for that room code, and clearly show an English error state when the token is invalid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "“scorer token” ...",
          "bez kont użytkowników"
        ]
      },
      "acceptanceCriteria": [
        "The Join Room flow provides an optional input labeled in English (e.g., \"Scorer token (optional)\") that is stored locally when provided.",
        "If a user navigates to Host / Scorer without a stored token, the page provides a token input labeled in English and a way to save it for the current room code.",
        "When backend rejects a mutation due to missing/invalid token, the UI displays an English error message and remains usable after correcting the token."
      ]
    },
    {
      "id": "REQ-96",
      "text": "Plumb the admin token through existing frontend API helper functions used by the Host / Scorer screen (e.g., functions in `frontend/src/lib/roomGameApi.ts` and `frontend/src/lib/roomsApi.ts`) so that all state-mutating actor calls include the token parameter, while read-only calls remain unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "endpointy modyfikujące stan wymagają headera X-ADMIN-TOKEN"
        ]
      },
      "acceptanceCriteria": [
        "All frontend calls that create/modify game state from the Host / Scorer UI include the admin token argument when calling the backend actor methods.",
        "Read-only calls (e.g., get room by code used for validation, realtime subscription setup) do not require a token.",
        "No user-facing text is introduced in languages other than English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (single-actor architecture).",
    "Frontend must not edit files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not introduce user accounts or third-party authentication; the solution must remain token + room code based as requested."
  ],
  "nonGoals": [
    "Do not implement Internet Identity login for this MVP authorization layer.",
    "Do not add role-based permissions beyond a single scorer/admin token.",
    "Do not require tokens for TV/display or other read-only views.",
    "Do not implement cryptographic signing or JWTs; a simple opaque token is sufficient."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}