{
  "kind": "build_request",
  "title": "Add backend Google OAuth configuration values with dev defaults and documentation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-148",
      "text": "Add backend configuration plumbing for Google OAuth using the following configuration keys (names must match exactly): GOOGLE_CLIENT_ID, GOOGLE_CLIENT_SECRET, GOOGLE_REDIRECT_URI, FRONTEND_OAUTH_REDIRECT. The backend must have a single authoritative configuration object/record for these values, and it must be safe to run in local development without any secrets by using sensible non-empty defaults.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Dodaj konfigurację OAuth Google z .env:\nGOOGLE_CLIENT_ID\nGOOGLE_CLIENT_SECRET\nGOOGLE_REDIRECT_URI\nFRONTEND_OAUTH_REDIRECT\nDla dev ustaw sensowne defaulty/README. Nie zmieniaj istniejących ustawień auth."
        ]
      },
      "acceptanceCriteria": [
        "Backend code contains a clearly defined configuration structure for the four Google OAuth values.",
        "All four keys exist and are named exactly as specified: GOOGLE_CLIENT_ID, GOOGLE_CLIENT_SECRET, GOOGLE_REDIRECT_URI, FRONTEND_OAUTH_REDIRECT.",
        "Local development works out-of-the-box (no required secrets) by falling back to sensible, non-empty defaults.",
        "No existing authentication behavior/logic is changed as part of introducing these configuration values."
      ]
    },
    {
      "id": "REQ-149",
      "text": "Expose a backend query method to retrieve the current Google OAuth configuration in a safe shape suitable for frontend usage, ensuring that secrets are not leaked (GOOGLE_CLIENT_SECRET must not be returned).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Dodaj konfigurację OAuth Google z .env:\nGOOGLE_CLIENT_ID\nGOOGLE_CLIENT_SECRET\nGOOGLE_REDIRECT_URI\nFRONTEND_OAUTH_REDIRECT"
        ]
      },
      "acceptanceCriteria": [
        "A backend query method exists that returns GOOGLE_CLIENT_ID, GOOGLE_REDIRECT_URI, and FRONTEND_OAUTH_REDIRECT (or an equivalent structured object containing them).",
        "The method does not return GOOGLE_CLIENT_SECRET in any form.",
        "The method is non-trapping for expected cases (e.g., defaults present)."
      ]
    },
    {
      "id": "REQ-150",
      "text": "Update upgrade safety to account for any new stable configuration state introduced for Google OAuth, following the project’s conditional migration policy so canister upgrades do not brick existing deployments.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Dodaj konfigurację OAuth Google z .env: ..."
        ]
      },
      "acceptanceCriteria": [
        "If the stable state layout changes, `backend/migration.mo` is updated so existing deployed state upgrades successfully.",
        "After upgrade, the Google OAuth configuration values are present (populated from previous state if applicable, otherwise initialized to documented defaults)."
      ]
    },
    {
      "id": "REQ-151",
      "text": "Document how to configure the four Google OAuth values for local development and production, including where and how a developer should set them, and list the dev defaults. Documentation must explicitly state that existing authentication settings are unchanged by this configuration step.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Dla dev ustaw sensowne defaulty/README. Nie zmieniaj istniejących ustawień auth."
        ]
      },
      "acceptanceCriteria": [
        "Documentation is added/updated (README and/or existing configuration docs) to list: GOOGLE_CLIENT_ID, GOOGLE_CLIENT_SECRET, GOOGLE_REDIRECT_URI, FRONTEND_OAUTH_REDIRECT.",
        "Docs include sensible dev defaults and explain how to override them for real Google OAuth credentials.",
        "Docs include an explicit note that this change does not modify existing authentication settings or flows."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in `backend/main.mo`.",
    "Follow the project migration policy: add/adjust `backend/migration.mo` only if stable state changes require it.",
    "Do not change existing authentication settings or flows; only add Google OAuth configuration plumbing.",
    "Do not leak GOOGLE_CLIENT_SECRET via any backend query or logging intended for app/clients."
  ],
  "nonGoals": [
    "Implementing the Google OAuth login/redirect flow end-to-end (authorization URL generation, callback handling, token exchange, user linking).",
    "Adding any new frontend UI for Google sign-in.",
    "Replacing or modifying the current Internet Identity-based authentication integration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}