{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Start Game configuration on / with localStorage handoff to /game",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Replace `/` StartGamePage placeholder content with a touch-friendly Start Game configuration form (mode 301/501, Double Out toggle, 1–4 player editor) using existing Tailwind styling.",
      "acceptanceCriteria": [
        "Visiting `/` shows controls for selecting 301 or 501 via radio buttons.",
        "Visiting `/` shows a 'Double Out' toggle switch that can be turned on/off.",
        "The page shows a player list with at least 1 player input row by default.",
        "User can add players up to a maximum of 4; when there are 4 players, 'Add player' is disabled or hidden.",
        "User can remove players when there are 2–4 players; remove control is disabled/hidden when there is only 1 player.",
        "All user-facing text on this page is in English (e.g., 'Game mode', '301', '501', 'Double Out', 'Players', 'Add player', 'Remove', 'Start Game')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StartGamePage.tsx",
          "operation": "modify",
          "description": "Replace marketing/placeholder UI with a configuration form: radio group for Game mode (301/501), a touch-friendly Double Out toggle, and a Players editor supporting 1–4 rows (add/remove with min/max constraints). Keep styling consistent with existing Tailwind patterns (large tap targets, rounded cards/buttons)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Persist selected settings to localStorage on 'Start Game' (no query string), sanitize blank player names with defaults, then navigate to `/game`.",
      "acceptanceCriteria": [
        "Clicking 'Start Game' stores a single settings object in localStorage and navigates to `/game`.",
        "If any player name input is empty or whitespace-only at the time of starting, it is replaced in the stored settings with 'Player N' (1-indexed).",
        "The stored settings include: selected starting score (301 or 501), the Double Out boolean, and an ordered list of 1–4 player names.",
        "No settings are passed via query string (localStorage is the chosen mechanism)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/gameSettings.ts",
          "operation": "create",
          "description": "Add a small localStorage utility for game settings: define a stable storage key, default settings, save/load helpers, and a sanitizer that trims names and fills blanks with 'Player N' (1-indexed)."
        },
        {
          "path": "frontend/src/pages/StartGamePage.tsx",
          "operation": "modify",
          "description": "Wire the 'Start Game' button to: sanitize current form state (trim + fill default player names), persist a single settings object to localStorage via the shared helper, then navigate to `/game` (no query-string usage)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Initialize `/game` from saved localStorage settings with safe defaults when missing, without adding scoring/turn logic.",
      "acceptanceCriteria": [
        "After configuring `/` and pressing 'Start Game', `/game` renders PlayerCard components for the same number of players (1–4) with the configured names.",
        "Each player's initial score displayed on `/game` matches the configured mode (301 or 501).",
        "Direct navigation to `/game` without prior settings does not error; the page shows a default configuration as specified.",
        "No scoring/turn logic is introduced beyond initializing the displayed player list/scores from settings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded mock players with initialization from localStorage settings using the shared helper; if absent/invalid, fall back to defaults (mode 501, Double Out off, two players 'Player 1'/'Player 2'). Use the resolved starting score to set each player's initial displayed score and render the corresponding number of PlayerCard items (1–4)."
        },
        {
          "path": "frontend/src/lib/gameSettings.ts",
          "operation": "modify",
          "description": "Ensure the load helper is resilient (e.g., malformed JSON or missing fields) and always returns a valid settings object matching the required defaults."
        }
      ]
    }
  ]
}